# -*- coding: utf-8 -*-

SYS__01 = ' Missing settings file! Need create "settings/local.py" or "settings/prod.py"'

PROVIDER__01 = 'Отсутствует обязательный метод провайдера: "debug"'
PROVIDER__02 = 'Отсутствует обязательный метод провайдера: "check_tests"'
PROVIDER__03 = 'В тесте указано не корректное вещественное число'

PYTHON__01 = 'Операции записи на диск запрещены'
PYTHON__02 = 'Превышен лимит времени на выполнение программы'

CPP__02 = 'Превышен лимит времени на выполнение программы'

CSHARP__02 = 'Превышен лимит времени на выполнение программы'
