# -*- coding: utf-8 -*-

PROVIDER__01 = 'Отсутствует обязательный метод провайдера: "debug"'
PROVIDER__02 = 'Отсутствует обязательный метод провайдера: "check_tests"'
PROVIDER__03 = 'В тесте указано не корректное вещественное число'

CPP__01 = 'Операции записи на диск запрещены'
CPP__02 = 'Превышен лимит времени на выполнение программы'
CPP__03 = 'Не указаны входные данные'

JAVA__01 = 'Операции записи на диск запрещены'
JAVA__02 = 'Превышен лимит времени на выполнение программы'

CSHARP__02 = 'Превышен лимит времени на выполнение программы'
